ICARUS/Computation/Solvers/OpenFoam/files/system/fvSchemes
/*----------------------------------------------------------------------------------*\
|                                                                                    |
|    ANSA_VERSION: 22.1.0                                                            |
|                                                                                    |
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              |
|                                                                                    |
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             |
|                                                                                    |
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class dictionary;
	location "";
	object fvSchemes;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

ddtSchemes
{
    default        steadyState;
}

gradSchemes
{
    default        Gauss linear;
}

divSchemes
{
    default        none;
    div(phi,U)      bounded Gauss linearUpwindV default;
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)      bounded Gauss upwind;
    div(phi,epsilon)      bounded Gauss upwind;
    div(phi,nuTilda)      bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default        Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

wallDist
{
    method meshWave;
}
